// 12개의 질문을 포함한 하나의 배열!
export const questioncontent = [{
  number: 1,
  question: "당신은 팀 스포츠를 선호합니까?, 혼자서 하는 스포츠를 선호합니까?",
  answer1 : "팀 스포츠를 선호한다",
  answer2 : "혼자서 하는 스포츠를 선호한다",
  type: "E"
},{
  number: 2,
  question: "당신은 룰이 명확한 스포츠를 좋아합니까?, 더 자유로운 스포츠를 좋아합니까?",
  answer1 : "룰이 명확한 스포츠를 좋아한다",
  answer2 : "자유로운 스포츠를 좋아한다",
  type: "S"
},{
  number: 3,
  question: "당신은 스포츠에서의 분석적인 전략을 중요하게 생각합니까?, 아니면 팀원 간의 관계와 감정을 중요하게 생각합니까?",
  answer1 : "분석적인 전략을 중요하게 생각한다",
  answer2 : "팀원 간의 인간적인 관계와 감정을 중요하게 생각한다",
  type: "T"
},{
  number: 4,
  question: "당신은 전략을 많이 필요로 하는 스포츠를 선호합니까?, 덜 전략적인 스포츠를 선호합니까?",
  answer1 : "전략을 많이 필요로 하는 스포츠를 선호한다",
  answer2 : "덜 전략적인 스포츠를 선호한다",
  type: "J"
},{
  number: 5,
  question: "당신은 다양한 사람들과의 소통이 많은 스포츠를 선호합니까?, 개인의 능력이 중요한 스포츠를 선호합니까?",
  answer1 : "다양한 사람들과의 소통이 많은 스포츠를 선호한다",
  answer2 : "개인의 능력이 중요한 스포츠를 선호한다",
  type: "E"
},{
  number: 6,
  question: "당신은 자신의 몸을 극한까지 도전하는 스포츠를 좋아합니까?",
  answer1 : "몸을 극한까지 도전하는 스포츠를 좋아한다",
  answer2 : "몸을 극한까지 도전하는 스포츠는 좋아하지 않는다",
  type: "S"
},{
  number: 7,
  question: "당신은 스포츠에서의 목표 달성과 성취가 더 중요하다고 생각합니까?, 아니면 경기 과정에서의 즐거움과 팀의 조화가 더 중요하다고 생각합니까?",
  answer1 : "목표 달성과 성취가 더 중요하다고 생각한다",
  answer2 : "경기 과정에서의 즐거움과 팀의 조화가 더 중요하다고 생각한다",
  type: "T"
},{
  number: 8,
  question: "당신은 꾸준한 훈련과 연습을 통해 목표를 달성하는 스포츠를 선호합니까?, 즉흥적으로 즐길 수 있는 스포츠를 선호합니까?",
  answer1 : "꾸준한 훈련과 연습을 통해 목표를 달성하는 스포츠를 선호한다",
  answer2 : "즉흥적으로 즐길 수 있는 스포츠를 선호한다",
  type: "J"
},{
  number: 9,
  question: "당신은 경기나 훈련이 끝난후에 다른 사람들과 함께 시간을 보내는 것을 선호합니까?, 아니면 혼자 휴식을 취하는 것을 선호합니까?",
  answer1 : "다른 사람들과 함께 시간을 보내는 것을 선호한다",
  answer2 : "혼자 휴식을 취하는 것을 선호한다",
  type: "E"
},{
  number: 10,
  question: "당신은 신체적인 능력을 중시하는 스포츠를 선호합니까?, 아니면 정신적인 집중력이 중요한 스포츠를 선호합니까?",
  answer1 : "신체적인 능력을 중시하는 스포츠를 선호한다",
  answer2 : "정신적인 집중력이 중요한 스포츠를 선호한다",
  type: "S"
},{
  number: 11,
  question: "당신은 스포츠에서의 전략과 계획이 승리의 요인이라고 생각합니까?, 아니면 선수들 간의 감정적인 연결과 팀워크가 승리의 요인이라고 생각합니까?",
  answer1 : "전략과 계획이 승리의 요인이라고 생각한다",
  answer2 : "선수들 간의 감정적인 연결과 팀워크가 승리의 요인이라고 생각한다",
  type: "T"
},{
  number: 12,
  question: "당신은 결과에 집중하는 스포츠를 선호합니까, 결과보다 과정을 중시하는 스포츠를 선호합니까?",
  answer1 : "결과에 집중하는 스포츠를 선호한다",
  answer2 : "결과보다 과정을 중시하는 스포츠를 선호한다",
  type: "J"
}


,{
  number: 1,
  question: "당신은 외향적인 E 입니까?, 내향적인 I 입니까?",
  answer1 : "외향적인 E",
  answer2 : "내향적인 I",
  type: "E"
},{
  number: 2,
  question: "당신은 현실적인 S 입니까?, 이상적인 N 입니까?",
  answer1 : "현실적인 S",
  answer2 : "직관적인 N",
  type: "S"
},{
  number: 3,
  question: "당신은 사고하는 T 입니까?, 감정적인 F 입니까?",
  answer1 : "사고하는 T",
  answer2 : "감정적인 F",
  type: "T"
},{
  number: 4,
  question: "당신은 계획하는 J 입니까?, 즉흥적인 P 입니까?",
  answer1 : "계획하는 J",
  answer2 : "즉흥적인 P",
  type: "J"
}]