// 16개의 성향을 포함한 하나의 배열!
export const resultcontent = [{
  type: "ISTJ",
  description: "ISTJ는 자기 규율이 강하며, 세부사항에 집중하는 경향이 있고, 구조적이고 일관된 활동을 선호하는 성격 유형입니다.<br /> 이러한 성격 특성을 고려하여 ISTJ에게 어울릴 것 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:테니스,수영,크로스핏,마라톤,골프"
},{
  type: "ISFJ",
  description: "ISFJ는 따뜻하고 친절하며, 조직에 잘 적응하고, 남을 도와주기를 좋아하는 성격 유형입니다.<br /> 이러한 성격 특징을 고려하여 ISFJ에게 어울릴 것 같은 스포츠를 추천드리겠습니다.<br /><br /><br />추천 스포츠:축구,농구,배구,볼링,배드민턴,수영,등산,테니스,스쿼시"
},{
  type: "INFJ",
  description: "INFJ는 깊이 있는 사고를 가지고 있으며, 내면의 세계에 집중하고, 직관적이며 감성적인 경향이 있습니다.<br /> 이러한 성격 특징을 고려하여 INFJ에게 어울릴 것 같은 스포츠를 추천드리겠습니다.<br /><br /><br />추천 스포츠:마라톤,수영,댄스,골프,등산"
},{
  type: "INTJ",
  description: "INTJ는 독립적이며, 높은 집중력과 계획성을 가지고 있고, 전략적인 사고와 깊은 내면의 세계를 가진 성격 유형입니다.<br /> 이러한 성격 특성을 고려하여 INTJ에게 어울릴 것 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:탁구,테니스,스쿼시,골프,등산"
},{
  type: "ISTP",
  description: "ISTP는 실용적이며, 현재 순간에 집중하고, 유연하며, 손재주가 있습니다.<br /> 그들은 종종 위험을 즐기며 새로운 경험을 탐색하는 것을 좋아합니다.<br /> 이러한 성격 특성을 고려하여 ISTP에게 어울릴 것 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:자동차레이싱,오토바이레이싱,락클라이밍,스케이트보딩,서핑,스키,스노보드"
},{
  type: "ISFP",
  description: "ISFP는 감성적이며, 유연하고, 현재 순간에 집중하는 경향이 있습니다.<br /> 그들은 종종 자신의 감정과 가치를 표현하는 데 중점을 둡니다.<br /> 이러한 성격 특성을 고려하여 ISFP에게 어울릴 것 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:서핑,배드민턴,무용,피겨스케이팅,댄스"
},{
  type: "INFP",
  description: "INFP는 깊은 감성을 가지고 있으며, 내면의 세계에 집중하는 경향이 있습니다.<br /> 그들은 종종 이상적이고 창의적이며, 자신의 가치와 믿음을 중요시합니다.<br /> 이러한 성격 특성을 고려하여 INFP에게 어울릴 것 같은 스포츠를 추천해 드리겠습니다.<br /><br />추천 스포츠:수영,마라톤,등산"
},{
  type: "INTP",
  description: "INTP는 분석적이고 창의적이며, 복잡한 문제나 패턴을 이해하는 데 탁월한 성향을 가지고 있습니다.<br /> 그들은 종종 독립적이며, 새로운 아이디어나 개념을 탐색하는 것을 즐깁니다.<br /> 이러한 성격 특성을 고려하여 INTP에게 어울릴 것 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:테니스,골프,스쿼시,양궁,클라이밍"
},{
  type: "ESTP",
  description: "ESTP는 에너지가 넘치며, 현실감 있고, 즉흥적인 성격을 가진 사람들입니다.<br />  새로운 경험을 탐색하고, 물리적 활동을 통해 주변 환경과 상호작용하는 것을 즐깁니다.<br />  ESTP의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /> <br /> 추천 스포츠:축구,농구,배구,스키,스노보드,익스트림 스포츠,서핑,배드민턴,테니스,스쿼시"
},{
  type: "ESFP",
  description: "ESFP는 활기차고, 사교적이며, 즉흥적인 성격의 사람들입니다.<br />  현재의 순간을 즐기며, 주변 사람들과의 상호작용을 중요하게 생각합니다.<br /> 또한, 새로운 경험과 활동을 탐색하는 것을 좋아합니다.<br /> 이러한 특성을 고려하여 ESFP에게 추천할 수 있는 스포츠는 다음과 같습니다.<br /><br /><br />추천 스포츠:축구,농구,배구,댄스,수상스키,서핑,마라톤"
},{
  type: "ENFP",
  description: "ENFP는 열정적이고 창의적이며, 새로운 경험을 탐색하는 것을 좋아하는 성격을 가진 사람들입니다.<br /> 그들은 다양한 활동을 통해 자신을 표현하고, 사람들과의 상호작용을 중요하게 생각합니다.<br /> ENFP의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:축구,농구,배구,등산,마라톤,서핑,스카이다이빙"
},{
  type: "ENTP",
  description: "ENTP는 지적 호기심이 많고, 즉흥적이며, 다양한 경험을 쌓는 것을 좋아하는 성격을 가진 사람들입니다.<br />  새로운 도전과 전략적 사고를 통해 문제를 해결하는 데 탁월하며, 기존의 방식이나 규칙에 얽매이지 않고 독창적인 접근을 선호합니다.<br /> ENTP의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:축구,농구,하키,테니스,스쿼시,마라톤,탁구,펜싱,익스트림 스포츠"
},{
  type: "ESTJ",
  description: "ESTJ는 실질적이며 조직과 계획에 강점을 지닌 성격 유형입니다.<br /> 그들은 리더십 역할을 자주 맡고, 그룹 내에서의 책임감과 질서를 중요하게 생각합니다.<br /> 이러한 ESTJ의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br /> 추천스포츠:럭비,농구,축구,야구,골프,테니스,마라톤,스키,스노보드"
},{
  type: "ESFJ",
  description: "ESFJ는 따뜻하고 사교적이며, 다른 사람들의 감정에 민감한 성격을 가진 사람들입니다.<br /> 그들은 사회적 활동을 즐기며, 팀워크와 협력을 중요하게 생각합니다.<br /> 또한, 자신이 속한 커뮤니티나 그룹에서의 조화와 질서를 중요시합니다.<br /> 이러한 ESFJ의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:배드민턴,테니스,배구,농구,축구,야구,필라테스,수영"
},{
  type: "ENFJ",
  description: "ENFJ는 사교적이고, 타인의 감정에 민감하며, 타인을 도와주고 지지하는 것을 좋아하는 성격을 가진 사람들입니다.<br /> 그들은 자신의 가치와 믿음을 통해 다른 사람들에게 영감을 주며, 집단 활동에서 리더십 역할을 자주 맡습니다.<br /> ENFJ의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:농구,축구,배구,배드민턴,댄스,등산"
},{
  type: "ENTJ",
  description: "ENTJ는 자신감 있고, 목적 지향적이며, 뛰어난 리더십 능력을 가진 성격을 가진 사람들입니다.<br /> 그들은 복잡한 문제를 해결하는 능력이 있으며, 계획과 조직에 강점을 지닙니다.<br /> 그들은 대개 경쟁적이며, 명확한 목표와 결과에 중점을 둡니다.<br /> ENTJ의 성격 특성을 고려하여, 다음과 같은 스포츠를 추천해 드리겠습니다.<br /><br /><br />추천 스포츠:농구,축구,야구,테니스,골프,마라톤,등산,격투기,철인3종경기"
}]

